{
  "about_SE": {
    "title": "Meet Bruno",
    "name": "I'm Bruno Guimarães",
    "description": ". I began my journey in software development as a full-stack developer, with a strong focus on front-end technologies. I've worked extensively with Next.js and TypeScript, crafting user-friendly applications and optimizing workflows. Originally from Brazil and now based in Dublin, Ireland, I have a solid foundation in mentoring startups and developing applications, where I gained a deep appreciation for clean code and efficient design. I'm always eager to learn new technologies and improve my skills. In my spare time, I enjoy assembling gaming PCs and advising clients on the best components for their gaming setups."
  },
  "about_chef": {
    "title": "Meet Bruno, Chef",
    "description": "Outside of coding, Bruno explores his love for cooking, where he combines technical precision with artistic flair. With a specialty in Portuguese and Italian cuisine, he excels in creating flavorful dishes that celebrate rich culinary traditions. His culinary journey reflects the same passion and attention to detail that he brings to software engineering, making each dish a unique and memorable experience."
  },
  "stats": {
    "title": "Statistics",
    "1": {
      "title": "Years",
      "number": 5,
      "description": "Years of experience in software development"
    },
    "2": {
      "title": "Recipes",
      "number": 40,
      "description": "Recipes crafted and shared with the community, family, and friends."
    },
    "3": {
      "title": "Projects",
      "number": 50,
      "description": "Private and public projects that leverage a diverse range of technologies."
    },
    "4": {
      "title": "Technologies",
      "number": 10,
      "description": "Technologies and programming languages utilized in past projects."
    }
  },
  "showcase": {
    "title": "Showcase",
    "msp": "My Software Projects",
    "description": "Discover a dynamic collection of software engineering projects where creativity meets cutting-edge technology."
  }
}

