{
  "about_SE": {
    "title": "Meet Bruno",
    "name": "I'm Bruno Guimarães da Silva",
    "description": [
      "I'm a full-stack software engineer specialized in building scalable, secure, and high-performance systems. My experience combines robust backend development (PHP and Go) with modern frontends using Next.js, Vite, Remix Run, and TypeScript. I focus on turning complex business problems into clean, maintainable, and efficient solutions through good architecture and code quality.",
      "I'm currently based in Brazil and working again at Gazin, one of the largest retail and distribution companies in the country. I collaborate on the evolution and modernization of corporate applications — including refactoring legacy monolithic systems, integrating distributed services, and creating microservices ready for production.",
      "I have solid experience with Oracle and advanced SQL (performance tuning, PL/SQL, indexing, CTEs, execution plan analysis). I've optimized critical routines, reducing processing times from minutes to seconds through modeling, refactoring, and query optimization.",
      "Even while working on a large-scale project, I'm open to new opportunities — including international projects, remote positions, consulting, and relocation. I have experience collaborating with global teams, strong communication skills, and adaptability to multicultural environments.",
      "I'm driven by challenges and curiosity. I enjoy taking legacy or overly complex systems and transforming them into modern, predictable, and scalable architectures. Outside of software, I build custom gaming PCs, advise people and companies on high-performance hardware, and cook Italian and Portuguese dishes — always with the same attention to detail and quality."
    ]
  },

  "stats": {
    "title": "Results in Numbers",
    "1": {
      "title": "Experience",
      "number": 5,
      "description": "Years working as a full-stack engineer in companies, startups, and international projects."
    },
    "3": {
      "title": "Delivered Projects",
      "number": 50,
      "description": "Systems, APIs, dashboards, microservices, automations, and high-impact integrations."
    },
    "4": {
      "title": "Technologies Mastered",
      "number": 12,
      "description": "Stacks applied in real-world production environments with measurable results."
    }
  },

  "education": {
    "title": "Education",
    "list": [
      {
        "degree": "Postgraduate Certificate — Advanced Go Development",
        "institution": "FullCycle College of Technology",
        "duration": "May 2024 – Nov 2024",
        "level": "EQF Level 7 / NQF Level 9",
        "description": "Advanced specialization focused on backend engineering and cloud-native architecture. Hands-on projects with microservices, concurrency, messaging, caching, gRPC, Protobuf, Docker, Kubernetes, observability, and production-ready code."
      },
      {
        "degree": "Technologist in Internet Systems",
        "institution": "Faculdade Alfa Umuarama",
        "duration": "Feb 2020 – Dec 2022",
        "description": "Practical and market-oriented program in software engineering, web development, databases, UX/UI, and security. Strong foundation for building end-to-end digital products."
      },
      {
        "degree": "Exchange Program — English & Cultural Immersion",
        "institution": "International School of English (ISE), Dublin — Ireland",
        "duration": "2024 – 2025",
        "description": "Fluency development, international networking, and active participation in global tech communities and meetups."
      }
    ]
  },

  "skills": {
    "title": "Skills & Expertise",
    "description": "I build full-cycle software — backend, frontend, architecture, and delivery — with focus on scalability, clean code, observability, and user experience.",

    "frontend": {
      "title": "Frontend Development",
      "list": [
        { "name": "Next.js", "description": "SEO-ready applications using SSR/SSG, hybrid routing, and performance optimization." },
        { "name": "React", "description": "Dynamic interfaces, responsive design, and user-centric flows." },
        { "name": "TypeScript", "description": "Predictable, maintainable, and safe code for growing codebases." },
        { "name": "Vite", "description": "Ultra-fast frontend development with instant hot reload and optimized builds." },
        { "name": "Remix Run", "description": "Full-stack web apps with loaders/actions, server components, and focus on performance." },
        { "name": "Chakra UI / Shadcn UI", "description": "Consistent UI, component reusability, accessibility, and design system patterns." },
        { "name": "Ext JS", "description": "Enterprise-level applications with complex UIs and data-heavy interfaces." }
      ]
    },

    "backend": {
      "title": "Backend Development",
      "list": [
        { "name": "Go (Golang)", "description": "High-performance services, concurrency models, production-ready APIs, and microservices." },
        { "name": "PHP", "description": "5+ years of experience with versions 5.2, 7.x and 8.x, including APIs, refactoring and legacy modernization." },
        { "name": "Microservices", "description": "Decomposition of monoliths, messaging, scalable distributed systems." },
        { "name": "Clean Architecture / DDD", "description": "Sustainable, testable, domain-oriented systems with low coupling." }
      ]
    },

    "optimization": {
      "title": "Problem Solving & Optimization",
      "list": [
        { "name": "Performance & Observability", "description": "Tracing, profiling, logs, monitoring and real-time problem diagnosis." },
        { "name": "Scalability", "description": "Architecture modernization, automation and high-volume workload optimization." },
        { "name": "Code Quality / TDD", "description": "Automated tests, pull-request reviews and continuous improvement culture." }
      ]
    },

    "database": {
      "title": "Databases & SQL",
      "list": [
        { "name": "Oracle / PL-SQL", "description": "Complex queries, tuning, indexing, CTEs, execution plans and mission-critical optimizations." },
        { "name": "PostgreSQL / MongoDB / Redis", "description": "Efficient data modeling, caching strategies, queues and persistence." }
      ]
    },

    "cloud": {
      "title": "Cloud & DevOps",
      "list": [
        { "name": "AWS (S3, EC2, RDS, SES, Route53)", "description": "Infrastructure, distributed deployments and cloud automation." },
        { "name": "Docker / Docker Compose", "description": "Reliable environments for development, testing and production pipelines." },
        { "name": "CI/CD (GitHub Actions, GitLab CI)", "description": "Automated builds, testing and continuous delivery." }
      ]
    },

    "other": {
      "title": "Additional Skills",
      "list": [
        { "name": "Technical Leadership & Mentoring", "description": "Guidance, architecture decisions and team alignment." },
        { "name": "Agile Methodologies", "description": "Scrum and Kanban focused on continuous delivery and efficiency." },
        { "name": "Adaptability", "description": "Fast learning of new technologies and excellent multicultural collaboration." }
      ]
    }
  }
}
