{
  "about_SE": {
    "title": "Conheça o Bruno",
    "name": "Sou Bruno Guimarães da Silva",
    "description": [
      "Sou engenheiro de software full-stack especializado em criar sistemas escaláveis, seguros e de alta performance. Minha experiência combina backend robusto (PHP e Go) com interfaces modernas usando Next.js, Vite e Remix Run. Meu foco é transformar problemas complexos em soluções simples e eficientes, com código limpo, rastreabilidade e arquitetura sustentável.",
      "Atualmente estou no Brasil e trabalhando novamente na Gazin, uma das maiores empresas de varejo e distribuição do país. Participo da evolução e modernização de aplicações corporativas — desde refatoração de monolitos até integração entre serviços, mensageria e criação de microsserviços.",
      "Tenho forte experiência em Oracle e SQL avançado (queries complexas, tuning, PL/SQL, indexação, CTEs e otimização de queries de alto volume). Já reduzi processos de minutos para segundos por meio de modelagem, refatoração e análise de execução.",
      "Mesmo atuando em um projeto de grande porte, estou disponível para novas oportunidades — incluindo projetos internacionais, trabalho remoto ou relocation. Tenho experiência trabalhando com equipes globais, inglês fluente e alta capacidade de adaptação.",
      "Sou movido por desafios e curiosidade. Gosto de pegar sistemas legados e transformá-los em algo moderno, escalável e previsível. Fora do código, monto PCs gamers sob demanda e cozinho pratos italianos e portugueses — com o mesmo foco em precisão e excelência."
    ]
  },

  "stats": {
    "title": "Resultados em números",
    "1": {
      "title": "Experiência",
      "number": 5,
      "description": "Anos atuando como desenvolvedor full-stack em empresas, startups e projetos internacionais."
    },
    "3": {
      "title": "Projetos entregues",
      "number": 50,
      "description": "Sistemas, APIs, dashboards, microsserviços e automações de processos complexos."
    },
    "4": {
      "title": "Tecnologias dominadas",
      "number": 12,
      "description": "Stacks aplicadas em cenários reais, com foco em performance e qualidade de entrega."
    }
  },

  "education": {
    "title": "Educação",
    "list": [
      {
        "degree": "Pós-graduação em Desenvolvimento Avançado com Go",
        "institution": "FullCycle College of Technology",
        "duration": "Maio 2024 – Nov 2024",
        "level": "EQF Nível 7 / NQF Nível 9",
        "description": "Especialização focada em backend e arquitetura cloud-native. Projetos práticos com microsserviços, concorrência, mensageria, caching, gRPC, Protobuf, Docker, Kubernetes e observabilidade."
      },
      {
        "degree": "Tecnólogo em Sistemas para Internet",
        "institution": "Faculdade Alfa Umuarama",
        "duration": "Fev 2020 – Dez 2022",
        "description": "Formação prática e orientada ao mercado em engenharia de software, desenvolvimento web, bancos de dados, UX/UI e segurança da informação. Ênfase em desenvolvimento de aplicações web completas."
      },
      {
        "degree": "Intercâmbio – Inglês e Imersão Cultural",
        "institution": "International School of English (ISE), Dublin, Irlanda",
        "duration": "2024 – 2025",
        "description": "Fluência em inglês, networking internacional e participação em eventos e comunidades globais de tecnologia."
      }
    ]
  },

  "skills": {
    "title": "Habilidades e Especialidades",
    "description": "Construo sistemas completos — do backend ao frontend — com foco em escalabilidade, arquitetura limpa e experiência do usuário. Sou movido por impacto e clareza na solução, não apenas por tecnologia.",

    "frontend": {
      "title": "Desenvolvimento Frontend",
      "list": [
        { "name": "Next.js", "description": "SSR/SSG, SEO, otimização de performance, rotas híbridas e aplicações escaláveis." },
        { "name": "React", "description": "Interfaces dinâmicas e responsivas com foco na experiência do usuário." },
        { "name": "TypeScript", "description": "Código seguro, previsível e organizado para projetos de longo prazo." },
        { "name": "Vite", "description": "Desenvolvimento frontend altamente produtivo com build super rápido e hot reload eficiente." },
        { "name": "Remix Run", "description": "Web apps com foco em performance, fluxo baseado em rotas, loaders e actions para full-stack com React." },
        { "name": "Chakra UI / Shadcn UI", "description": "Design system modular, acessível e com consistência visual." },
        { "name": "Ext JS", "description": "Desenvolvimento de aplicações corporativas complexas e telas com alta densidade de dados." }
      ]
    },

    "backend": {
      "title": "Desenvolvimento Backend",
      "list": [
        { "name": "Go (Golang)", "description": "Serviços de alta performance, concorrência, APIs REST e microserviços prontos para produção." },
        { "name": "PHP", "description": "Mais de 5 anos de experiência com versões 5.2, 7.x e 8.x em APIs, integrações e sistemas corporativos." },
        { "name": "Microsserviços", "description": "Transição de monolitos para microsserviços, mensageria e escalabilidade horizontal." },
        { "name": "Arquitetura Limpa / DDD", "description": "Sistemas modulares, testáveis e evolutivos, com baixo acoplamento entre camadas." }
      ]
    },

    "optimization": {
      "title": "Resolução de Problemas e Otimização",
      "list": [
        { "name": "Performance & Observabilidade", "description": "Tracing, logs estruturados, profiling e resolução de gargalos em produção." },
        { "name": "Escalabilidade", "description": "Refatoração de legados e otimização de pipelines e arquiteturas." },
        { "name": "Qualidade de Código / TDD", "description": "Testes automatizados, code reviews e cultura de melhoria contínua." }
      ]
    },

    "database": {
      "title": "Banco de Dados & SQL",
      "list": [
        { "name": "Oracle / PL-SQL", "description": "Queries complexas, tuning, CTEs, indexing e otimização de rotinas críticas." },
        { "name": "PostgreSQL / MongoDB / Redis", "description": "Estratégias de caching, filas, persistência e modelagem eficiente." }
      ]
    },

    "cloud": {
      "title": "Cloud & DevOps",
      "list": [
        { "name": "AWS (S3, EC2, RDS, SES, Route53)", "description": "Infraestrutura escalável, automação e deploy em cloud." },
        { "name": "Docker / Docker Compose", "description": "Ambientes reprodutíveis e pipelines consistentes." },
        { "name": "CI/CD (GitHub Actions, GitLab CI)", "description": "Automação de testes, build e entrega contínua." }
      ]
    },

    "other": {
      "title": "Outras Habilidades",
      "list": [
        { "name": "Mentoria e Liderança Técnica", "description": "Alinhamento de equipes, decisões técnicas e orientação de carreira." },
        { "name": "Metodologias Ágeis", "description": "Scrum e Kanban com foco em entrega contínua e previsibilidade." },
        { "name": "Adaptabilidade", "description": "Alta capacidade de adaptação a novas tecnologias e ambientes multiculturais." }
      ]
    }
  }
}
