{
  "about_SE": {
    "title": "Conheça Bruno, Engenheiro de Software",
    "description": "Bruno é um engenheiro de software apaixonado, com 5 anos de experiência, que adora combinar tecnologia e criatividade. Ele se especializa em desenvolvimento front-end e possui ampla experiência com TypeScript, PHP e SQL. Sua dedicação em criar experiências intuitivas para os usuários o motiva a aprender continuamente e se adaptar ao dinâmico mundo da tecnologia."
  },
  "about_chef": {
    "title": "Conheça Bruno, Chef",
    "description": "Fora do mundo da programação, Bruno explora sua paixão pela culinária, onde combina precisão técnica com um toque artístico. Especializado em culinária portuguesa e italiana, ele se destaca na criação de pratos saborosos que celebram ricas tradições gastronômicas. Sua jornada culinária reflete a mesma paixão e atenção aos detalhes que ele traz para a engenharia de software, tornando cada prato uma experiência única e memorável."
  },
  "stats": {
    "title": "Estatísticas",
    "1": {
      "title": "+5 Anos",
      "description": "Anos de experiência em desenvolvimento de software"
    },
    "2": {
      "title": "+40 Receitas",
      "description": "Receitas criadas e compartilhadas com a comunidade, família e amigos."
    },
    "3": {
      "title": "+50 Projetos",
      "description": "Projetos privados e públicos que utilizam uma ampla variedade de tecnologias."
    },
    "4": {
      "title": "+10 Tecnologias",
      "description": "Tecnologias e linguagens de programação utilizadas em projetos anteriores."
    }
  },
  "showcase": {
    "title": "Portfólio",
    "msp": "Meus Projetos de Software",
    "description": "Descubra uma coleção dinâmica de projetos de engenharia de software, onde a criatividade encontra a tecnologia de ponta."
  },
  "projects": {
    "1": {
      "title": "E-commerce B2B - Gazin Atacado",
      "description": "O Gazin Atacado é uma plataforma de e-commerce B2B projetada para atender empresas e revendedores. O site oferece uma ampla gama de produtos, desde eletrodomésticos até móveis, com condições exclusivas para atacado. Os clientes podem navegar por um catálogo completo, fazer pedidos com facilidade e acompanhar suas compras com total transparência. É a solução ideal para quem busca agilidade e eficiência nas operações."
    }
  }
}
